MPS/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПодтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПодтверждена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДисконтнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТикетАвторизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Catalogs/Клиенты/Forms/РазблокированиеРеквизитов/Module.bsl
Результат.Добавить("Код;СформироватьИД");
	Результат.Добавить("ДатаРождения");
	Результат.Добавить("Пол");
	Результат.Добавить("ГруппаДоступа");
	Результат.Добавить("ЧасовойПояс");
	Результат.Добавить("ЗонаДоставки");
	Результат.Добавить("Телефон");
	Результат.Добавить("Почта");
	Результат.Добавить("Фамилия");
	Результат.Добавить("Имя");
	Результат.Добавить("Отчество");
	Результат.Добавить("КодДисконтнойКарты");
	Результат.Добавить("ДатаРегистрации");

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	РазрешитьРедактированиеКод = Истина;
	РазрешитьРедактированиеДатаРождения                      = Истина;
	РазрешитьРедактированиеПол                        = Истина;
	РазрешитьРедактированиеГруппаДоступа                = Истина;
	РазрешитьРедактированиеЛокации                    = Истина;
	РазрешитьРедактированиеТелефон                    = Истина;
	РазрешитьРедактированиеПочта                    = Истина;
	РазрешитьРедактированиеФИО                    = Истина;
	РазрешитьРедактированиеКодДисконтнойКарты                    = Истина;
	РазрешитьРедактированиеДатаРегистрации                    = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеКод Тогда
		Результат.Добавить("Код");
	КонецЕсли;
	
	Если РазрешитьРедактированиеДатаРождения Тогда
		Результат.Добавить("ДатаРождения");
	КонецЕсли;
	
	Если РазрешитьРедактированиеРасписание Тогда
		Результат.Добавить("Расписание");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСпособФормирования Тогда
		Результат.Добавить("СпособФормирования");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЗапретОтгрузки Тогда
		Результат.Добавить("ЗапретОтгрузки");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
